Autodesk.Navisworks.Api.Plugins.InputPlugin
A plugin that can respond to mouse and keyboard inputs.

Autodesk.Navisworks.Api.Plugins.InputPlugin.#ctor
Default constructor for an InputPlugin

Autodesk.Navisworks.Api.Plugins.InputPlugin.ContextMenu(Autodesk.Navisworks.Api.View,System.Int32,System.Int32)
ContextMenu handler.

Autodesk.Navisworks.Api.Plugins.InputPlugin.GetCursor(Autodesk.Navisworks.Api.View,Autodesk.Navisworks.Api.KeyModifiers)
GetCursor handler.

Autodesk.Navisworks.Api.Plugins.InputPlugin.GetHelpIdAtPoint(Autodesk.Navisworks.Api.View,System.Int32,System.Int32)
GetHelpIdAtPoint handler.

Autodesk.Navisworks.Api.Plugins.InputPlugin.GetHelpIdForHighlight(Autodesk.Navisworks.Api.View)
GetHelpIdForHighlight handler.

Autodesk.Navisworks.Api.Plugins.InputPlugin.GetTooltip(Autodesk.Navisworks.Api.View,System.Int32,System.Int32)
GetTooltip handler

Autodesk.Navisworks.Api.Plugins.InputPlugin.KeyDown(Autodesk.Navisworks.Api.View,Autodesk.Navisworks.Api.KeyModifiers,System.UInt16,System.Double)
MouseLeave handler.

Autodesk.Navisworks.Api.Plugins.InputPlugin.KeyDrag(Autodesk.Navisworks.Api.View,Autodesk.Navisworks.Api.KeyModifiers,System.Double)
KeyDrag  handler.

Autodesk.Navisworks.Api.Plugins.InputPlugin.KeyUp(Autodesk.Navisworks.Api.View,Autodesk.Navisworks.Api.KeyModifiers,System.UInt16,System.Double)
KeyUp handler.

Autodesk.Navisworks.Api.Plugins.InputPlugin.ModifierKeyDown(Autodesk.Navisworks.Api.View,Autodesk.Navisworks.Api.KeyModifiers,System.Double)
ModifierKeyDown handler.

Autodesk.Navisworks.Api.Plugins.InputPlugin.ModifierKeyUp(Autodesk.Navisworks.Api.View,Autodesk.Navisworks.Api.KeyModifiers,System.Double)
ModifierKeyUp handler.

Autodesk.Navisworks.Api.Plugins.InputPlugin.MouseDown(Autodesk.Navisworks.Api.View,Autodesk.Navisworks.Api.KeyModifiers,System.UInt16,System.Int32,System.Int32,System.Double)
Mouse down handler.

Autodesk.Navisworks.Api.Plugins.InputPlugin.MouseDrag(Autodesk.Navisworks.Api.View,Autodesk.Navisworks.Api.KeyModifiers,System.Int32,System.Int32,System.Double)
Mouse drag handler.

Autodesk.Navisworks.Api.Plugins.InputPlugin.MouseLeave(Autodesk.Navisworks.Api.View,System.Double)
Mouse leave handler.

Autodesk.Navisworks.Api.Plugins.InputPlugin.MouseMove(Autodesk.Navisworks.Api.View,Autodesk.Navisworks.Api.KeyModifiers,System.Int32,System.Int32,System.Double)
Mouse move handler.

Autodesk.Navisworks.Api.Plugins.InputPlugin.MouseUp(Autodesk.Navisworks.Api.View,Autodesk.Navisworks.Api.KeyModifiers,System.UInt16,System.Int32,System.Int32,System.Double)
Mouse up handler.

Autodesk.Navisworks.Api.Plugins.InputPlugin.WheelDrag(Autodesk.Navisworks.Api.View,Autodesk.Navisworks.Api.KeyModifiers,System.Int32,System.Int32,System.UInt16,System.Double,System.Double)
WheelDrag handler.